<p><strong>8.10.Задачи</strong>
</p>
<p>1. Запишите конструкцию, которая реализовывала бы следующий алгоритм:
</p>
<p style="margin-left: 20px;"> если x не равен 0
</p>
<p style="margin-left: 40px;"> вычислить выражение y = 1/x
</p>
<p style="margin-left: 40px;"> вывести значение переменной y на экран
</p>
<p style="margin-left: 20px;"> в противном случае
</p>
<p style="margin-left: 40px;"> вывести сообщение о том, что x не может быть равен 0.
</p>
<p>2. Записать конструкцию, с помощью которой программа выдавала бы на экран один символ, код которого содержится в переменной ch, если значение этой переменной не равно символу новой строки.
</p>
<p>3. Записать конструкцию, с помощью которой десять раз повторится оператор printf("Hello World\n");
</p>
<p>4. Написать программу расчета корней квадратного уравнения (ax<sup>2</sup> + bx + c = 0). В программе сделать необходимые проверки, а именно: коэффициент a не должен быть равен 0 и дискриминант не должен быть отрицательным.
</p>
<p>5. Написать программу, которая проверяет, является ли введенное пользователем целое число четным.
</p>
<p>6. Написать программу, вычисляющую сумму и среднее арифметическое последовательности положительных чисел, которые вводятся с клавиатуры. Ввод чисел закончить 0.
</p>
<p>7. Написать программу, которая запрашивает у пользователя номер дня недели и выводит одно из сообщений: "Рабочий день", "Суббота" или "Воскресенье".
</p>
<p>8. Напишите программу, которая запрашивает у пользователя номер дня недели, затем выводит название дня недели или сообщение об ошибке, если введены неверные данные.
</p>
<p>9. Написать программу, которая переводит время, заданное в формате ЧЧ:ММ:СС (часы:минуты:секунды) в секунды. Программа должна проверять правильность введенных пользователем данных.
</p>
<p>10. Написать программу, которая выводит таблицу степеней двойки от нулевой до десятой не используя функцию pow.
</p>
<p>11. Написать программу, которая генерирует последовательность из 10 случайных чисел в диапазоне от 1 до 10, выводит эти числа на экран и вычисляет их среднее арифметическое.
</p>
<p>12. В калькуляторе реализовать операцию, которая бы выполняла возведение числа a в степень b. Для этого воспользоваться функцией pow(a,b), результатом которой будет число a<sup>b</sup>. Код операции можно обозначить символом ^.
</p>